### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import string
import re
import warnings
warnings.filterwarnings("ignore")

### Reading dataset

In [2]:
df = pd.read_csv('ProductsData.csv',encoding='iso-8859-1')
df.head()

,Product_name,Product_id,Product_Category,price,Professional_Publication,Region_address,Local_address
0,"""chambre a coucher ""","""40008817""","""Meubles et décoration """,1 800,"""private""","""Grand Casablanca""","""Casablanca"""
1,"""Comte free fire""","""40008816""","""Jeux vidéo et consoles """,,"""private""","""Grand Casablanca""","""Casablanca"""
2,"""Iphone 6 plus""","""40008815""","""Téléphones """,,"""private""","""Grand Casablanca""","""Casablanca"""
3,"""Renault ""","""40008814""","""Voitures """,,"""private""","""Chaouia-Ouardigha""","""Settat"""
4,"""PS3 SLIM 360 GB ""","""40008812""","""Jeux vidéo et consoles """,1 400,"""private""","""Rabat-Salé-Zemmour-Zaër""","""Sala Al-Jadida"""

In [3]:
df.shape

(4350, 7)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4350 entries, 0 to 4349
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Product_name              4350 non-null   object
 1   Product_id                4350 non-null   object
 2   Product_Category          4350 non-null   object
 3   price                     3580 non-null   object
 4   Professional_Publication  4350 non-null   object
 5   Region_address            4350 non-null   object
 6   Local_address             4350 non-null   object
dtypes: object(7)
memory usage: 238.0+ KB

In [5]:
df.columns

Index(['Product_name', 'Product_id', 'Product_Category', 'price',
       'Professional_Publication', 'Region_address', 'Local_address'],
      dtype='object')

In [6]:
#filtering out relevant columns
df = df[['Product_name','Product_id','Product_Category','price','Professional_Publication']]

In [7]:
df.head()

,Product_name,Product_id,Product_Category,price,Professional_Publication
0,"""chambre a coucher ""","""40008817""","""Meubles et décoration """,1 800,"""private"""
1,"""Comte free fire""","""40008816""","""Jeux vidéo et consoles """,,"""private"""
2,"""Iphone 6 plus""","""40008815""","""Téléphones """,,"""private"""
3,"""Renault ""","""40008814""","""Voitures """,,"""private"""
4,"""PS3 SLIM 360 GB ""","""40008812""","""Jeux vidéo et consoles """,1 400,"""private"""

In [8]:
#removing quotes in the individual values
def remove_quotes(x):
    x = x.replace('"','')
    return x

In [9]:
df['Product_name'] = df['Product_name'].apply(remove_quotes)
df['Product_id'] = df['Product_id'].apply(remove_quotes)
df['Product_Category'] = df['Product_Category'].apply(remove_quotes)
df['Professional_Publication'] = df['Professional_Publication'].apply(remove_quotes)

In [10]:
df.head()

,Product_name,Product_id,Product_Category,price,Professional_Publication
0,chambre a coucher,40008817,Meubles et décoration,1 800,private
1,Comte free fire,40008816,Jeux vidéo et consoles,,private
2,Iphone 6 plus,40008815,Téléphones,,private
3,Renault,40008814,Voitures,,private
4,PS3 SLIM 360 GB,40008812,Jeux vidéo et consoles,1 400,private

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4350 entries, 0 to 4349
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Product_name              4350 non-null   object
 1   Product_id                4350 non-null   object
 2   Product_Category          4350 non-null   object
 3   price                     3580 non-null   object
 4   Professional_Publication  4350 non-null   object
dtypes: object(5)
memory usage: 170.0+ KB

In [12]:
df.head()

,Product_name,Product_id,Product_Category,price,Professional_Publication
0,chambre a coucher,40008817,Meubles et décoration,1 800,private
1,Comte free fire,40008816,Jeux vidéo et consoles,,private
2,Iphone 6 plus,40008815,Téléphones,,private
3,Renault,40008814,Voitures,,private
4,PS3 SLIM 360 GB,40008812,Jeux vidéo et consoles,1 400,private

In [13]:
#removing saces between the values of the price
df['price'] = df['price'].str.replace(' ', '')

In [14]:
df.head()

,Product_name,Product_id,Product_Category,price,Professional_Publication
0,chambre a coucher,40008817,Meubles et décoration,1800,private
1,Comte free fire,40008816,Jeux vidéo et consoles,,private
2,Iphone 6 plus,40008815,Téléphones,,private
3,Renault,40008814,Voitures,,private
4,PS3 SLIM 360 GB,40008812,Jeux vidéo et consoles,1400,private

In [15]:
punc = string.punctuation
punc

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'

In [16]:
df.tail(10)

,Product_name,Product_id,Product_Category,price,Professional_Publication
4340,siera grand frigidaire,39234547,Electroménager et vaisselles,3500,private
4341,samsung s10e,39234538,Téléphones,3100,private
4342,407,39234535,Voitures,34000,private
4343,Megane 2 diesel,39234534,Voitures,63000,private
4344,PC portable Asus,39234530,Ordinateurs portables,5000,private
4345,XN-C11,39234529,Instruments de musique,90,private
4346,Uno,39234527,Voitures,20000,private
4347,???? ????????? ????? ????,39234526,Matériels professionnels,,pro
4348,Poussette Bugaboo cameleon 3 black,39234524,Equipements pour enfant et bébé,1850,private
4349,Iphone xs max,39234523,Téléphones,NaN,private

In [17]:
#renaming columns into meaningful names
df = df.rename(columns={'Product_name':'name','Product_id':'id','Product_Category':'category','Professional_Publication':'publication'})

In [18]:
#let's remove some special characters in categorica columns
for char in punc:
    df['name'] = df['name'].str.replace(char, '')
    df['category'] = df['category'].str.replace(char, '')
    df['publication'] = df['publication'].str.replace(char,'')

In [19]:
#Create a function that replaces blank spaces with nan
def clean(x):
    if x.isspace():
        return np.nan
    else:
        return x

In [20]:
df['name'] = df['name'].apply(clean)

In [21]:
df['id'] = df['id'].apply(clean)
df['category'] = df['category'].apply(clean)
df['publication'] = df['publication'].apply(clean)

In [22]:
df.tail()

,name,id,category,price,publication
4345,XNC11,39234529,Instruments de musique,90,private
4346,Uno,39234527,Voitures,20000,private
4347,NaN,39234526,Matériels professionnels,,pro
4348,Poussette Bugaboo cameleon 3 black,39234524,Equipements pour enfant et bébé,1850,private
4349,Iphone xs max,39234523,Téléphones,NaN,private

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4350 entries, 0 to 4349
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         4105 non-null   object
 1   id           4350 non-null   object
 2   category     4350 non-null   object
 3   price        3580 non-null   object
 4   publication  4350 non-null   object
dtypes: object(5)
memory usage: 170.0+ KB

In [24]:
#let's do the same for 'price' column
def clean2(x):
    if isinstance(x, str) and x.isspace(): # checking whether it's a string
        return np.nan
    else:
        return x

In [25]:
df['price'] = df['price'].apply(clean2)

In [26]:
df.tail()

,name,id,category,price,publication
4345,XNC11,39234529,Instruments de musique,90,private
4346,Uno,39234527,Voitures,20000,private
4347,NaN,39234526,Matériels professionnels,NaN,pro
4348,Poussette Bugaboo cameleon 3 black,39234524,Equipements pour enfant et bébé,1850,private
4349,Iphone xs max,39234523,Téléphones,NaN,private

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4350 entries, 0 to 4349
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         4105 non-null   object
 1   id           4350 non-null   object
 2   category     4350 non-null   object
 3   price        3129 non-null   object
 4   publication  4350 non-null   object
dtypes: object(5)
memory usage: 170.0+ KB

In [28]:
#removing null values
df.dropna(inplace = True)

In [30]:
#changing dtypes of 'id' and 'price' columns to their appropriate
df['price'] = df['price'].astype(float)
df['id'] = df['id'].astype(int)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2969 entries, 0 to 4348
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         2969 non-null   object
 1   id           2969 non-null   int32
 2   category     2969 non-null   object
 3   price        2969 non-null   float64
 4   publication  2969 non-null   object
dtypes: float64(1), int32(1), object(3)
memory usage: 127.6+ KB

In [33]:
df.head()

,name,id,category,price,publication
0,chambre a coucher,40008817,Meubles et décoration,1800.0,private
4,PS3 SLIM 360 GB,40008812,Jeux vidéo et consoles,1400.0,private
5,Need For Speed Heat Xbox One Neuf,39955729,Jeux vidéo et consoles,549.0,pro
7,Nikel,40008809,Voitures,75000.0,private
8,compte free fire,40008808,Jeux vidéo et consoles,170.0,private

In [34]:
#chacking and removing duplicates
df.duplicated().sum()

406

In [35]:
df.drop_duplicates(inplace=True)

In [36]:
df.head()

,name,id,category,price,publication
0,chambre a coucher,40008817,Meubles et décoration,1800.0,private
4,PS3 SLIM 360 GB,40008812,Jeux vidéo et consoles,1400.0,private
5,Need For Speed Heat Xbox One Neuf,39955729,Jeux vidéo et consoles,549.0,pro
7,Nikel,40008809,Voitures,75000.0,private
8,compte free fire,40008808,Jeux vidéo et consoles,170.0,private

In [37]:
#let's convert the columns of interest to a list
df['category'] = df['category'].apply(lambda x:x.split())
df['publication'] = df['publication'].apply(lambda x:x.split())

In [38]:
df.head(3)

,name,id,category,price,publication
0,chambre a coucher,40008817,"[Meubles, et, décoration]",1800.0,[private]
4,PS3 SLIM 360 GB,40008812,"[Jeux, vidéo, et, consoles]",1400.0,[private]
5,Need For Speed Heat Xbox One Neuf,39955729,"[Jeux, vidéo, et, consoles]",549.0,[pro]

In [39]:
#combining columns into one so that we can perform vectorization
df['content'] = df['category'] + df['publication']

In [40]:
df.drop(columns=['category','publication'],inplace=True)

In [41]:
df.head()

,name,id,price,content
0,chambre a coucher,40008817,1800.0,"[Meubles, et, décoration, private]"
4,PS3 SLIM 360 GB,40008812,1400.0,"[Jeux, vidéo, et, consoles, private]"
5,Need For Speed Heat Xbox One Neuf,39955729,549.0,"[Jeux, vidéo, et, consoles, pro]"
7,Nikel,40008809,75000.0,"[Voitures, private]"
8,compte free fire,40008808,170.0,"[Jeux, vidéo, et, consoles, private]"

In [42]:
# making the column in paragraph form
df['content'] = df['content'].apply(lambda x:" ".join(x))
df.head()

,name,id,price,content
0,chambre a coucher,40008817,1800.0,Meubles et décoration private
4,PS3 SLIM 360 GB,40008812,1400.0,Jeux vidéo et consoles private
5,Need For Speed Heat Xbox One Neuf,39955729,549.0,Jeux vidéo et consoles pro
7,Nikel,40008809,75000.0,Voitures private
8,compte free fire,40008808,170.0,Jeux vidéo et consoles private

In [43]:
#lowercasing
df['content'] = df['content'].str.lower()

In [44]:
df.reset_index(drop=True,inplace=True)

In [45]:
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import sigmoid_kernel,cosine_similarity

In [46]:
#creating a matrix
vect = TfidfVectorizer()
matrix = vect.fit_transform(df['content'])

In [47]:
#defining similarity
sim = cosine_similarity(matrix)

In [48]:
sim.shape

(2563, 2563)

In [49]:
sim

array([[1.        , 0.15130908, 0.10339205, ..., 0.04321001, 0.11621884,
        0.11689159],
       [0.15130908, 1.        , 0.95409795, ..., 0.03031219, 0.0815285 ,
        0.08200044],
       [0.10339205, 0.95409795, 1.        , ..., 0.        , 0.        ,
        0.05603229],
       ...,
       [0.04321001, 0.03031219, 0.        , ..., 1.        , 0.07579945,
        0.02341723],
       [0.11621884, 0.0815285 , 0.        , ..., 0.07579945, 1.        ,
        0.06298364],
       [0.11689159, 0.08200044, 0.05603229, ..., 0.02341723, 0.06298364,
        1.        ]])

In [55]:
#making recommendation
def reccomend(new_product):
    ind = df[df['name'] == new_product].index[0]
    distance = sorted(list(enumerate(sim[ind])),reverse = True,key = lambda x: x[1])
    for i in distance[1:6]:
        print(df['name'].iloc[i[0]])

In [56]:
reccomend('Nikel')

Nikel
Dacia Logan
Audi A3 finition Sline
kia picanto
fiat 500 automatique

### Saving models

In [61]:
import pickle
pickle.dump(df,open('products.pkl','wb'))
pickle.dump(sim,open('cos_similarity.pkl','wb'))